-- 0
INSERT INTO "round"("data", "name")
VALUES ('', '1 круг'),
       ('', '2 круг'),
       ('1', '1 тур'),
       ('1', '2 тур'),
       ('1', '3 тур'),
       ('1', '4 тур'),
       ('1', '5 тур'),
       ('1', '6 тур'),
       ('1', '7 тур'),
       ('1', '8 тур'),
       ('1', '9 тур'),
       ('1', '10 тур'),
       ('1', '11 тур'),
       ('1', '12 тур'),
       ('1', '13 тур'),
       ('1', '14 тур'),
       ('1', '15 тур'),
       ('1', '16 тур'),
       ('1', '17 тур'),
       ('1', '18 тур'),
       ('1', '19 тур'),
       ('1', '20 тур'),
       ('1', '21 тур'),
       ('1', '22 тур'),
       ('1', '23 тур'),
       ('1', '24 тур'),
       ('1', '25 тур'),
       ('1', '26 тур'),
       ('1', '27 тур'),
       ('1', '28 тур'),
       ('1', '29 тур'),
       ('1', '30 тур');

INSERT INTO "tournament"("emoji", "full", "sign", "short", "status")
VALUES ('🌍', 'Лига наций', 'LN', 'ЛН', 0),
       ('🇷🇺', 'Чемпионат России', 'Rus', 'ЧР', 0);

INSERT INTO "tournamentSeasonHandler"("id", "sign")
VALUES (0, 'C');

INSERT INTO "type"("id", "sign")
VALUES (0, 'C'),
       (1, 'N');

INSERT INTO "user"("emoji", "id", "name", "sign", "telegram")
VALUES ('', 0, 'Perke', 'P', 'peterperke'),
       ('', 1, 'Jagry', 'J', 'whiteseaer'),
       ('', 2, 'Kardick', 'K', 'el_kardo');
--1
INSERT INTO "roundLink"("child", "index", "parent")
VALUES (3, 0, 1),
       (4, 1, 1),
       (5, 2, 1),
       (6, 3, 1),
       (7, 4, 1),
       (8, 5, 1),
       (9, 6, 1),
       (10, 7, 1),
       (11, 8, 1),
       (12, 9, 1),
       (13, 10, 1),
       (14, 11, 1),
       (15, 12, 1),
       (16, 13, 1),
       (17, 14, 1),
       (18, 0, 2),
       (19, 1, 2),
       (20, 2, 2),
       (21, 3, 2),
       (22, 4, 2),
       (23, 5, 2),
       (24, 6, 2),
       (25, 7, 2),
       (26, 8, 2),
       (27, 9, 2),
       (28, 10, 2),
       (29, 11, 2),
       (30, 12, 2),
       (31, 13, 2),
       (32, 14, 2);

INSERT INTO "season"("start", "finish")
VALUES (22, 23),
       (22, 24);
--2
INSERT INTO "tournamentSeason"("handler", "index", "season", "tournament")
VALUES (0, 0, 1, 1),
       (0, 1, 1, 2);
--3
INSERT INTO "seasonRound"("index", "round", "ts")
VALUES (0, 1, 2),
       (1, 2, 2);

INSERT INTO "team" ("name", "ts")
VALUES ('Локомотив', 2),
       ('Спартак', 2),
       ('Ахмат', 2),
       ('Динамо', 2),
       ('Зенит', 2),
       ('Краснодар', 2),
       ('КС', 2),
       ('ПНН', 2),
       ('Оренбург', 2),
       ('Ростов', 2),
       ('Сочи', 2),
       ('Торпедо', 2),
       ('Урал', 2),
       ('Факел', 2),
       ('Химки', 2),
       ('ЦСКА', 2);
-- 4
INSERT INTO "match"("round", "team1", "team2", "time")
VALUES (3, 15, 5, '2022-07-15 20:00:00');
-- 5
INSERT INTO "bet"("goal1", "goal2", "match", "user")
VALUES (1, 2, 1, 1),
       (1, 2, 1, 2);
